#Напишите программу, которая предлагает пользователю ввести вещественное число, которое обозначает объем бензина
#(в галлонах). Программа должна вычислять: объем бензина (в литрах); количество баррелей нефти, требуемых для того,
#чтобы получить такой объем бензина; объем углекислого газа при сжигании в двигателе это бензина (в фунтах);
#эквивалентный объем этанола (в галлонах), стоимость в долларах США.

vg = float(input())                                     #объем бензина в галлонах
vl = vg * 3.785                                         #объем бензина в литрах
kb = vg / 19.5                                          #количество баррелей бензина
vf = vg * 20                                            #объем углекислого газа в фунтах
tvg = vg * 115000                                       #термические единицы бензин
kve = tvg / 75700                                       #количество галлонов этанола
sg = vg * 3                                             #стоимость бензина в долларах США

#Далее опираемся на данные 2017 года. Примерное количество автомобтлей в России 44 млн, расход топлива 80 млрд литров

sr_month = ((80 * 10 ** 9) / (44 * 10 * 6)) / 12        #расход бензина в месяц для владельцев автомобилей
sr_year = sr_month * 12                                 #расход бензина в год на человека
summ_city = sr_year * 57032                             #расход бензина для Искитима в год
summ_day = summ_city / 365                              #расход бензина для Искитима в день
summ_country = sr_year * 144500000                      #расход бензина для страны в год

print ('Объем бензина в литрах:', vl)
print ('Количество баррелей нефти:', kb)
print ('Объем углекислого газа в фунтах:', vf)
print ('Эквивалентный объем этанола в галлонах:', kve)
print ('Стоимость бензина в долларах США:', sg)
print('Расход бензина для Искитима в день:', summ_day)
print ('Расход бензина для России в год:', summ_country)